2 + 17.

49 * 100.

1289 - 2023.

5 / 2.

5 div 2.

5 rem 2.

(50 * 100) - 1000.

2#101010.

8#0677.

16#AE.

One = 1.

Two = One + One.

% 不合法 %
Two = Two + One

47 = 45 + 2.

true and false.

false or true.

true xor false.

not false.

not (true and true).

5 =:= 5.

1 =:= 0.

1 =/= 0.

5 =:= 5.0.

% 浮点数和整数直接的值比较 %
5 == 5.0. % true

5 /= 5.0.

1 < 2.

1 < 1.

1 >= 1.

1 =< 1.

% Tuples %
X = 10, Y = 4.
Point = {X, Y}.

Point = {4, 5}.
{X, Y} = Point.
X.
{X, _} = Point.


% List %
[1, 2, 3, {numbers, [4, 5, 6]}, 5.34, atom].


[97, 98, 99].       % "abc"
[97, 98, 99, 4].    % [97, 98, 99, 4]

[1, 2, 3] ++ [4, 5].        % [1, 2, 3, 4, 5]
[1, 2, 3, 4, 5] -- [1, 2].  % [3, 4, 5]

% 结合：从右向左
[1, 2, 3] -- [1, 2] -- [3]. % [3]

hd([1, 2, 3, 4]).   % [1]
tl([1, 2, 3, 4]).   % [2, 3, 4]


List = [2, 3, 4].
NewList = [1 | List].

